app/Controllers/EditarForm.php

SELECT *
FROM `formulario`
WHERE `formulario`.`id_formulario` = '2'
---
    public function index($id_formulario)
    {
        $formularioModel = new FormularioModel();

        $equipo = $formularioModel->find($id_formulario);

SELECT *
FROM `formulario`
WHERE `numero_inventario` = 'LL_350A'
 LIMIT 1
---
        $numero_inventario = $this->request->getVar('numero_inventario');
        $imagen = $this->request->getFile('imagen');

        $equipoExistente = $formularioModel->where('numero_inventario', $numero_inventario)->first();