app/Controllers/Formulario.php

SELECT *
FROM `formulario`
WHERE `numero_inventario` = 'LL_350A'
 LIMIT 1
---
            $numero_inventario = $this->request->getVar('numero_inventario');

            // Verificar si el equipo ya existe en la base de datos
            $equipoExistente = $formularioModel->where('numero_inventario', $numero_inventario)->first();

INSERT INTO `formulario` (`numero_inventario`, `descripcion`, `id_marcas`, `modelo`, `ano_fabricacion`, `valor_adquisicion`, `id_responsable`, `estado`, `numero_serie`, `vida_util`, `fecha_alta`, `seccion`, `dependencia`, `comentarios`) VALUES ('LL_350A', 'Escritorios ', '1', 'Escritorio_PL', '2020', '650000', '1', 'Activo', '908090', '3', '', 'H_90', '', '')
---
                'comentarios' => $this->request->getVar('comentarios'),
            ];

            $formularioModel->save($data);