app/Models/FormularioModel.php

SELECT `formulario`.*, `marcas`.`nombre_marca`, `responsables`.`nombre_responsable`
FROM `formulario`
LEFT JOIN `marcas` ON `marcas`.`id_marcas` = `formulario`.`id_marcas`
LEFT JOIN `responsables` ON `responsables`.`id_responsable` = `formulario`.`id_responsable`
---
    public function getEquipos()
    {
        return $this->select('formulario.*, marcas.nombre_marca, responsables.nombre_responsable')
                    ->join('marcas', 'marcas.id_marcas = formulario.id_marcas', 'left')
                    ->join('responsables', 'responsables.id_responsable = formulario.id_responsable', 'left')
                    ->findAll();

SELECT *
FROM `marcas`
WHERE `vigencia` = 1
---
    public function getMarcas()
    {
        return $this->db->table('marcas')
                    ->where('vigencia', 1)
                    ->get()
                    ->getResultArray();

SELECT *
FROM `responsables`
WHERE `vigencia` = 1
---
    public function getResponsables()
    {
        return $this->db->table('responsables')
                    ->where('vigencia', 1)
                    ->get()
                    ->getResultArray();

SELECT *
FROM `tipo_equipo`
---
    public function getTipoEquipo()
    {
        return $this->db->table('tipo_equipo')->get()->getResultArray();

SELECT *
FROM `formulario`
WHERE `numero_inventario` = 'RYT_0'
 LIMIT 1
---
    public function obtenerEquipoPorInventario($numero_inventario)
    {
        return $this->where('numero_inventario', $numero_inventario)->first();

UPDATE `formulario` SET `numero_inventario` = 'LL_350A', `estado` = 'Baja', `descripcion` = 'Escritorios ', `id_marcas` = '1', `modelo` = 'Escritorio_PL', `id_tipo_equipo` = '', `numero_serie` = '908090', `ano_fabricacion` = '2020', `vida_util` = '3', `fecha_alta` = '', `valor_adquisicion` = '650000.00', `id_responsable` = '1', `seccion` = 'H_90', `dependencia` = '', `comentarios` = ''
WHERE `formulario`.`id_formulario` IN ('2')
---
    public function actualizarEquipo($id_formulario, $data)
    {
        return $this->update($id_formulario, $data);