app/Models/MarcasModel.php

    public function eliminarMarca($id)
    {
        $formularioModel = new FormularioModel();
        $formulario = $formularioModel->where('id_marcas', $id)->first();
---
SELECT *
FROM `formulario`
WHERE `id_marcas` = '1'
 LIMIT 1

    public function getMarcadatos()
    {
        return $this->select('marcas.*, usuarios.nombre_usuario as nombre_usuario')
                    ->join('usuarios', 'usuarios.id_usuario = marcas.id_usuario', 'left')
                    ->findAll();
---
SELECT `marcas`.*, `usuarios`.`nombre_usuario` as `nombre_usuario`
FROM `marcas`
LEFT JOIN `usuarios` ON `usuarios`.`id_usuario` = `marcas`.`id_usuario`

    public function obtenerMarcaConUsuario($id_marcas)
    {
        return $this->select('marcas.*, usuarios.nombre_usuario as nombre_usuario')
                    ->join('usuarios', 'usuarios.id_usuario = marcas.id_usuario', 'left')
                    ->where('id_marcas', $id_marcas)
                    ->first();
---
SELECT `marcas`.*, `usuarios`.`nombre_usuario` as `nombre_usuario`
FROM `marcas`
LEFT JOIN `usuarios` ON `usuarios`.`id_usuario` = `marcas`.`id_usuario`
WHERE `id_marcas` = '2'
 LIMIT 1

    public function actualizarMarcaa($id, $data)
    {
        return $this->update($id, $data);
---
UPDATE `marcas` SET `nombre_marca` = 'INTEL', `vigencia` = '0', `fecha_audita` = '2025-01-11', `id_usuario` = '6'
WHERE `marcas`.`id_marcas` IN ('2')