app/Models/ResponsablesModel.php

    public function obtenerResponsablesConUsuario()
    {
        return $this->select('responsables.*, usuarios.nombre_usuario')
                    ->join('usuarios', 'usuarios.id_usuario = responsables.id_usuario', 'left')
                    ->findAll();
---
SELECT `responsables`.*, `usuarios`.`nombre_usuario`
FROM `responsables`
LEFT JOIN `usuarios` ON `usuarios`.`id_usuario` = `responsables`.`id_usuario`