app/Models/usuarioModel.php

SELECT *
FROM `usuarios`
WHERE `vigencia` = 1
---
    public function obtenerUsuariosActivos()
    {
        return $this->where('vigencia', 1)->findAll();